# TriangleCount Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TriangulatedShellComponent..::..TriangleCount Property
TriangulatedShellComponent Class See Also
---
The number of triangles in the triangulation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int TriangleCount { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TriangleCount As Integer
	Get
```

Visual C++
---
```text
public:
property int TriangleCount {
	int get ();
}
```

# See Also
TriangulatedShellComponent Class
Autodesk.Revit.DB Namespace